#+title:  Use Linux kernel module
#+subtitle: Kernel
#+date:   2021-09-30
#+tags[]: linux kernel module c

In [[/post/2020-03-24-write-linux-kernel-module/][Part 1]] I wrote a simple Linux kernel module, called World, in [[http://localhost:1313/post/2020-08-25-configure-linux-kernel-module/][Part 2]] I configured that module, now it's time to use that module from within kernel space (another kernel module).

** 2.1 Build Hello

Execute /make/ using the same Makefile/Kbuild files from [[/post/2020-03-24-write-linux-kernel-module/][Part 1]] to compile and build /hello.ko/ module file.
Notice the /depends/ line below, *Hello* module depends on *World* module and /parm/ lines with two params: *howmany* and *greet*.

#+begin_src sh :results output
  modinfo hello.ko
#+end_src

#+RESULTS:
#+begin_example
filename:       /home/icostan/Projects/blog/content/post/hello.ko
license:        Dual BSD/GPL
description:    Hello module that depends on World module
author:         Iulian Costan <blog@costan.ro
srcversion:     BB1B2CF1CD93B39F4366E4F
depends:        world
retpoline:      Y
name:           hello
vermagic:       5.14.8-arch1-1 SMP preempt mod_unload
parm:           howmany:int
parm:           greet:charp
#+end_example

** 2.2 Install Hello

As I mentioned before, during module install/load we can change the parameters as follows:

#+begin_src sh
  echo 'Installing module...'
  sudo insmod ./hello.ko greet=Bonjour howmany=3
#+end_src

After successful installation,

#+begin_src sh :results output
  journalctl -k | grep Hello
#+end_src

#+RESULTS:
: Sep 30 08:55:28 drakarys kernel: Init, Hello

parameters are correctly set,

#+begin_src sh :results output
  cat /sys/module/hello/parameters/greet
  cat /sys/module/hello/parameters/howmany
#+end_src

#+RESULTS:
: Bonjour
: 3

and *world_print* function from World module was called 3 times, as expected.

#+begin_src sh :results output
  journalctl -k | grep Bonjour
#+end_src

#+RESULTS:
: Sep 30 08:55:28 drakarys kernel: Bonjour, World
: Sep 30 08:55:28 drakarys kernel: Bonjour, World
: Sep 30 08:55:28 drakarys kernel: Bonjour, World

And this is it... our useless Hello module calling World module on install but in next part we will talk about mode interesting stuff like /device drivers/ or maybe /ioctl/ and /syscalls/, let's see.
